#include <stdio.h> // Импорт стандартной библы для ввода и вывода 

#define SIZE 10 // Константа для Inventory 

// Названия предметов по ID (индекс = ID) 
const char *names[10] = {"Пусто", "Дерево", "Камень", "Семена", "Железная руда", 
    "Золотая руда", "Алмазная руда", 
    "Вода", "Ягоды", "Веревка"};

/* Не дает программе упасть если ввели не число (единственная строчка, которую я не смогу объяснить) */
int readInt() {
    int x; 
    while (scanf("%d", &x) != 1) {printf("Ошибка! Введите число: "); 
        while (getchar() != '\n');} 
        return x;
}

// =========== MAIN ========= //
int main(void) 
{
    // Инициализация основных переменных 
    int current_day = 1;
    int current_hour = 8;
    int inventory[SIZE] = {1, 1, 4, 5, 6, 7, 8, 3, 0, 0}; // Разложил инвентарь 
    int choice;

    // ====== МЕНЮ ====== //
    do {
        printf("====== МЕНЮ ======");
        printf("\n1. - Посмотреть на часы\n");
        printf("2. - Промотать время (Поработать)\n");
        printf("3. - Посмотреть инвентарь\n");
        printf("4. - Положить предмет в слот\n");
        printf("5. - Выбросить предмет\n");
        printf("6. - Очистить мусор\n"); // Мой 5-ый вариант 
        printf("0. - Выход\n");

        printf("Выбор: ");

        printf("Выбор: ");
        choice = readInt(); // Выбор варианта пользователем 

        // РАБОТА ЭТОГО МЕНЮ //
        switch (choice) 
            {
                // Если пользователь дурак, default - срабатывает, когда не сработал не один case 
                default:
                printf("Нет такого пункта меню.\n");
                break;

                case 0:
                case 1:
                case 2:
                case 3:
                case 4:
                case 5:
                case 6:
            }

        } while (choice != 0); /* Работает пока пользователь выбрал */
    
    
}