#include <stdio.h> // Импорт стандартной библы для ввода и вывода 

#define SIZE 10 // Константа для Inventory 

// Названия предметов по ID (индекс = ID) 
const char *names[10] = {"Пусто", "Дерево", "Камень", "Семена", "Железная руда", 
    "Золотая руда", "Алмазная руда", 
    "Вода", "Ягоды", "Веревка"};

/* Не дает программе упасть если ввели не число (единственная строчка, которую я не смогу объяснить) */
int readInt() {
    int x; 
    while (scanf("%d", &x) != 1) {printf("Ошибка! Введите число: "); 
        while (getchar() != '\n');} // точнее вот это
        return x;
}

// =========== MAIN ========= //
int main(void) 
{
    // Инициализация основных переменных 
    int current_day = 1;
    int current_hour = 8;
    int inventory[SIZE] = {1, 1, 4, 5, 6, 7, 8, 3, 0, 0}; // Разложил инвентарь 
    int choice;

    // ====== МЕНЮ ====== //
    do {
        printf("====== МЕНЮ ======");
        printf("\n1. - Посмотреть на часы\n");
        printf("2. - Промотать время (Поработать)\n");
        printf("3. - Посмотреть инвентарь\n");
        printf("4. - Положить предмет в слот\n");
        printf("5. - Выбросить предмет\n");
        printf("6. - Очистить мусор\n"); // Мой 5-ый вариант 
        printf("0. - Выход\n");

        printf("Выбор: ");

        printf("Выбор: ");
        choice = readInt(); // Выбор варианта пользователем 

        // РАБОТА ЭТОГО МЕНЮ //
        switch (choice) 
            {
                // Если пользователь дурак, default - срабатывает, когда не сработал не один case 
                default:
                printf("Нет такого пункта меню.\n");
                break;

                case 0: // ВЫХОД 
                    printf("Выход...\n"); break;

                case 1: // ПОСМОТРЕТЬ ВРЕМЯ 
                    printf("Текущее время: День %d, %02d:00\n", current_day, current_hour); break;
                    // В %02d закидывается current_hour и добавляется к нему 0 слева если там 1 цифра
                    
                case 2: // ПРОМАТАТЬ ВРЕМЯ (ПОРАБОТАТЬ)
                    {printf("Сколько часов работать? "); // Спрашиваем пользователя
                    int hour_input = readInt();

                    // Если не адекватный
                    if (hour_input < 0) {printf("Часы не могут быть отрицательными!\n"); break;}

                    // Дальше если он адекватный 
                    else {current_hour += hour_input; // Прибавляем часы к current_hour 
                        while (current_hour >= 24) {current_hour -= 24; current_day += 1;}}    
                        // Если перебросилось на следующие сутки или несколько 

                    // Выводим день и время сколько получилось по итогу после проматывания 
                    printf("Теперь: День %d, %02d:00\n", current_day, current_hour); break;} 
                

                case 3: // ПОСМОТРЕТЬ ИНВЕНТАРЬ
                    // Перебор и вывод каждого слота
                    for (int num = 0; num < SIZE; num++) 
                        {if (inventory[num] >= 0 && inventory[num] <= 9) 
                        {printf("Слот %d: [%d] (%s)\n", num, inventory[num], names[inventory[num]]);}} break;
                            // %s - закидывает имя предмета (names[inventory[num]]) 
                        
                case 4: // ПОЛОЖИТЬ ПРЕДМЕТ В СЛОТ
                    {printf("Введите индекс слота (0-9): "); // Запрашиваем индекс у пользователя
                    int index = readInt();

                    // Если пользватель не адекватный 
                    if (index < 0 || index > 9) {printf("Ошибка! Нет такого слота\n"); break;}

                    // Если адекватный - дальше 
                    else 
                    {printf("Введите ID предмета: "); // Запрашиваем ID предмета
                        int ID = readInt();
                        
                        // Если введен не правльный ID
                        if (ID < 0 || ID > SIZE) {printf("Введен не правильный ID!\n"); break;}

                        // Если все нормально - дальше
                        else {inventory[index] = ID;} // Кладем в слот
                        printf("Предмет: %s - положен в %d слот", names[inventory[ID]], index);} break;} // Выводим

                case 5: // ВЫБРОСИТЬ ПРЕДМЕТ
                    // Запрашиваем индекс у пользователя
                    {printf("Введите индекс слота (0-9): "); 
                    int index = readInt();
                    
                    // Введен не верный индекс
                    if (index < 0 || index > 9) {printf("Ошибка! Нет такого слота\n"); break;}

                    // Если все нормально - дальше
                    // Удаляем и выводим какой слот отчистили
                    else {inventory[index] = 0; printf("Слот: %d - очищен!\n", index);} break;} 


                    case 6:
                } 
                            
                

    } while (choice != 0); // Работает пока пользователь выбрал 
       
return 0;}